{"by":"akashindya","descendants":41,"id":15530862,"kids":[15531196,15531093,15531386,15534046,15541526,15538481,15531714,15531746,15531747,15531114,15533227,15530890,15533002,15531974,15531362],"score":91,"text":"Hey HN!\nI am Akash, co-founder of Cashfree(<a href=\"https:&#x2F;&#x2F;www.cashfree.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cashfree.com</a>).<p>Cashfree is India&#x27;s first payments platform that automates inbound and outbound bank transfers. This replaces the slow, error prone alternative of uploading Excel files for bulk payments or manually reconciling payments received via bank transfers. Using Cashfree, payouts that took more than a day to process, happen instantly and independent of banking hours.<p>We help businesses like fintech platforms and marketplaces to easily setup custom payment flows to receive and disburse money.<p>Cashfree is being used for automated payouts and collections for use cases like -<p>* Supply chain collections by distributors<p>* Crowdfunding campaigns<p>* Marketplace vendor settlements<p>* Instant deposits and withdrawals at bitcoin exchanges<p>* Payroll for on-demand economy workers<p>* Loan disbursal and repayment by lenders<p>* Invoice payments at Modern ERP and Accounting tools<p>* Instant refunds (versus 5-7 days presently)<p>We started Cashfree to help e-commerce customers pay for their COD orders on delivery, through their mobile. While running Cashfree, we faced challenges around settling payouts to our partner merchants. Our partner merchants too shared similar problems and it made us dive deeper. We found no other payments company solving this common problem and decided to build a solution.<p>We support RESTful APIs that can be integrated easily with tech stack of a business (a) to carry out payouts and (b) automatically reconcile inbound bank transfers. Our solutions are built on top of banking infrastructure and are compliant with the regulations.<p>Would love to answer your questions about Cashfree and look forward to discuss anything on payments and bank transfers.","time":1508735309,"title":"Launch HN: Cashfree (YC S17) – Automated Payouts and Bank Transfers for India","type":"story"}