{"by":"tastyface","descendants":14,"id":15536005,"kids":[15540424,15544658,15536153,15536299,15538309,15537711,15536234,15536255,15536519,15536995,15536099,15540055],"score":17,"text":"Hi HN! I&#x27;m a 29-year-old programmer who left my SV job four-odd years ago to pursue a life of travel and indie development (at least until my savings ran out). Travel-wise, things have just been peachy. Career-wise, I&#x27;ve accomplished a whole lot compared to what I was doing before, including developing a bunch of small&#x2F;medium-sized native iOS and OSX apps (one of which grossed $10k+), publishing a (simple == sub 1k line) open source project that has close to a thousand stars, blogging about technical topics (nothing too fancy), and implementing&#x2F;blogging a very interesting CS research paper. If I play my cards right, I have maybe 1-2 years of independent living left, assuming I don&#x27;t get another &quot;hit&quot;.<p>Still, I am filled with dread. By my own evaluation, my progress has slow, and I feel like I could have accomplished 2-3x as much during my &quot;sabbatical&quot; if only I spent a bit less time procrastinating and forced myself into unfamiliar programming territory. (I perceive this as having wasted about 2-2.5 whole years out of this period.) I have a recurring, deep-seated fear that if my cash runs out and I have to re-enter the job market, I&#x27;ll simply find myself unemployable. Although I&#x27;m almost 30, I don&#x27;t really view myself as a senior engineer material; I can implement stuff just fine if given a blueprint, but my experience with high-level architectures and complicated, stateful systems is lacking. (Working on getting better at this, though. Lots of projects in the pipeline.) I also have zero managerial experience since I&#x27;ve been entirely working by myself. On the plus side, I have a CS degree from an excellent university, though I imagine the importance of this wanes as you get older.<p>HN, are my fears justified? Am I just falling into a bottomless pit, career-wise? Or is this stuff correctable?","time":1508785485,"title":"Ask HN: Late twenties, last four years spent fiddling w/projects. Employability?","type":"story"}