{"by":"Harj","id":15545988,"score":1,"text":"Triplebyte, http:&#x2F;&#x2F;triplebyte.com, has built a credentials blind process for evaluating engineering skill and helping companies hire great people from any background. We&#x27;re profitable and our investors include the founders of Y Combinator, Paul Graham and Jessica Livingston. We were founded by Harj Taggar, the first non-founding partner at Y Combinator, and the co-founders of Socialcam (acquired by Autodesk with 100 million active users).<p>We&#x27;re hiring Account Managers at Triplebyte. The details of this role vary between companies. At Triplebyte the goal of an Account Manager is helping companies get really good at hiring. The main way to achieve this is by making it easy for them to start using Triplebyte. This involves walking them through our software, explaining our process and answering their questions. Account Managers help build relationships with our companies so they can provide a great experience to candidates and exceed their hiring goals.<p>We also have a lot of data on how to run a great hiring process, gathered from observing the hundreds of companies we&#x27;ve worked with. Account Managers use this data to advise companies e.g. if  their conversion of offers to hires is lower than our average, we want to help them build a plan to increase it. This work is consultative and rewarding, especially as you really get to know the companies.<p>The Account Management team at Triplebyte is still very early, you&#x27;d get a lot of responsibility immediately and have input into how the role and team evolves over time. It&#x27;s an especially great role for anyone who wants to build expertise in a process that&#x27;s key to the success of any company - hiring well. You can get an idea of the kind of data we&#x27;ve collected and analyzed on this topic at our blog: http:&#x2F;&#x2F;triplebyte.com&#x2F;blog<p>You&#x27;ll get to work with some great companies. Our customers include big technology companies like Apple, exciting late stage startups like Dropbox and Stripe, self driving car companies like Cruise and early stage companies innovating in areas like healthcare, education and hardware. At a recent CTO summit, senior engineering executives and leaders from over 160 companies including Apple, Google and Slack said:<p>_&quot;Triplebyte has garnered a following. It&#x27;s a service that helps candidates take coding quizzes that qualify them to connect with a number of jobs. As an employer, there&#x27;s an advantage, because you only have to pay per hire you actually make.&quot;_<p>If you&#x27;d be interested in the role, please apply here: https:&#x2F;&#x2F;jobs.lever.co&#x2F;triplebyte&#x2F;a8647ccf-83e3-4f48-b9be-d396323926e2","time":1508886582,"title":"Triplebyte (YC S15) Is Hiring Account Managers","type":"job"}